# ViewSolarstudyIsSingledayStudyType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyIsSingledayStudyType Property
ParameterTypeId Class See Also
---
"Single day study"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyIsSingledayStudyType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyIsSingledayStudyType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyIsSingledayStudyType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace